컨트롤 엔터: 실행+다음 줄 쉬프트+엔터: 실행
컨트롤 + 더블클릭: 편집모드
단축키 code Y, Mode M Raw R
Code mode: 파이썬 코드
Markdown mode: 설명(Md 파일 - 마크다운 문법 존재, 깃헙에서도 쓰임)
# 샵 한 개는 제목
# >는 막대모양이 나옴
> !pip show pandas
# 링크는 대괄호, 주소값 소괄호
.[pandas cheat sheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
Raw mode: 텍스트 그대로 쓰는 것

In [2]:
# pandas의 설치 여부를 확인한다.
!pip show pandas

Name: pandas
Version: 0.25.1
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: http://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: /opt/conda/lib/python3.7/site-packages
Requires: numpy, pytz, python-dateutil
Required-by: vincent, statsmodels, seaborn, plotnine, mizani

# 2. pandas를 import한다.
> import pandas as pd

In [4]:
# pandas 업데이트는 신중하게
# 라이브러리 numpy를 불러온다. 라이브러리 별칭은 np로 임의로 설정
import numpy as np
import pandas as pd

In [9]:
# 시리즈는 클래스!, 개체생성하기
# numpy의 nan은 
# 시리즈 인자는 하나, 여러개 넣어줄 때는 리스트, 딕셔너리, 튜플등으로 넣기
# 시리즈는 같은 종류의 자료형으로 묶인 것
# 리스트 안의 자료형이 여러개면 datatype이 object로 잡힘
pd.Series([1,3,'5', np.nan,6,8])

0      1
1      3
2      5
3    NaN
4      6
5      8
dtype: object

In [10]:
# dataframe은 표로 이해하면 된다.
# 시리즈가 여러개 합쳐진 표.
# date_range: 파이썬의 range와 같은 기능
dates = pd.date_range('20130101',periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
# randn: 6행 4열짜리로 랜덤으로 정규분포로 숫자생성, columns는 행이름, index는 열이름
df = pd.DataFrame(np.random.randn(6,4),index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.435571  0.116686  0.414054 -0.696546
2013-01-02  1.557891  0.043704  1.250088 -0.169691
2013-01-03  1.205867  0.136809  1.125442 -1.530207
2013-01-04  0.198191  1.046273 -0.067392  0.808591
2013-01-05  1.429235 -1.690102  0.887965 -0.199856
2013-01-06  1.722446 -0.275181  0.085287 -0.440648

In [12]:
df2 = pd.DataFrame({'A': 1.,
   ...:                     'B': pd.Timestamp('20130102'),
   ...:                     'C': pd.Series(1, index=list(range(4)), dtype='float32'),
   ...:                     'D': np.array([3] * 4, dtype='int32'),
   ...:                     'E': pd.Categorical(["test", "train", "test", "train"]),
   ...:                     'F': 'foo'})

In [17]:
df2

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [18]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [19]:
# 자료 디폴트=5개 출력 (앞에서)
# 출력 갯수 임의로  설정가능
df.head()

                   A         B         C         D
2013-01-01 -0.435571  0.116686  0.414054 -0.696546
2013-01-02  1.557891  0.043704  1.250088 -0.169691
2013-01-03  1.205867  0.136809  1.125442 -1.530207
2013-01-04  0.198191  1.046273 -0.067392  0.808591
2013-01-05  1.429235 -1.690102  0.887965 -0.199856

In [20]:
# 출력 갯수 임의로  설정가능
df.tail()

                   A         B         C         D
2013-01-02  1.557891  0.043704  1.250088 -0.169691
2013-01-03  1.205867  0.136809  1.125442 -1.530207
2013-01-04  0.198191  1.046273 -0.067392  0.808591
2013-01-05  1.429235 -1.690102  0.887965 -0.199856
2013-01-06  1.722446 -0.275181  0.085287 -0.440648

In [27]:
# 샘플 하나 랜덤 출력
# 출력 갯수 임의로  설정가능
df.sample()

                   A         B         C         D
2013-01-04  0.198191  1.046273 -0.067392  0.808591

In [32]:
# 열 이름
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [33]:
# 행 이름
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [34]:
# to_numpy: 데이터 프레임을 넘파이 형태로 바꿈
# 배열 형태로 바뀜(이때, 자료형은 맞춰주는 것을 권장)
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [35]:
df.to_numpy()

array([[-0.43557061,  0.11668643,  0.41405365, -0.69654555],
       [ 1.55789122,  0.04370352,  1.25008794, -0.1696913 ],
       [ 1.20586673,  0.13680933,  1.12544196, -1.53020746],
       [ 0.19819056,  1.04627261, -0.06739211,  0.80859077],
       [ 1.42923503, -1.69010158,  0.88796523, -0.19985649],
       [ 1.7224455 , -0.27518113,  0.08528671, -0.44064784]])

In [37]:
# 행별로 count:갯수, mean:평균, std: 표준편차, min:최소값, 25%:4분위수, 50%: 중위값
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.946343 -0.103635  0.615907 -0.371393
std    0.865596  0.894053  0.552273  0.763655
min   -0.435571 -1.690102 -0.067392 -1.530207
25%    0.450110 -0.195460  0.167478 -0.632571
50%    1.317551  0.080195  0.651009 -0.320252
75%    1.525727  0.131779  1.066073 -0.177233
max    1.722446  1.046273  1.250088  0.808591

In [38]:
# 행/열 전환
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.435571    1.557891    1.205867    0.198191    1.429235    1.722446
B    0.116686    0.043704    0.136809    1.046273   -1.690102   -0.275181
C    0.414054    1.250088    1.125442   -0.067392    0.887965    0.085287
D   -0.696546   -0.169691   -1.530207    0.808591   -0.199856   -0.440648

In [40]:
# axis: 행렬중 기준으로 할 것을 설정, default=0(index)
# ascending: defalut=True(오름차순), False(내림차순)
# sort_values(axis=0,ascending=True)
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.696546  0.414054  0.116686 -0.435571
2013-01-02 -0.169691  1.250088  0.043704  1.557891
2013-01-03 -1.530207  1.125442  0.136809  1.205867
2013-01-04  0.808591 -0.067392  1.046273  0.198191
2013-01-05 -0.199856  0.887965 -1.690102  1.429235
2013-01-06 -0.440648  0.085287 -0.275181  1.722446

In [42]:
# 열 'B'의 값을 기준으로 테이블 정렬
# df.sort_values(by='B')
# axis: 정렬 대상이 되는 축(행/열) default=0(index)
df.sort_values(axis=1,by='20130105')

                   B         D         C         A
2013-01-01  0.116686 -0.696546  0.414054 -0.435571
2013-01-02  0.043704 -0.169691  1.250088  1.557891
2013-01-03  0.136809 -1.530207  1.125442  1.205867
2013-01-04  1.046273  0.808591 -0.067392  0.198191
2013-01-05 -1.690102 -0.199856  0.887965  1.429235
2013-01-06 -0.275181 -0.440648  0.085287  1.722446

# -특정 값만 행,열 지정해서 가지고 올 때
>df.컬럼명
>df.['컬럼명']
>df.[['컬럼명','컬럼명']]
>df.loc[행]
>df.loc[행,열]

In [43]:
# 특수문자가 이름안에 포함되어 있는 경우 못 씀
df.A

2013-01-01   -0.435571
2013-01-02    1.557891
2013-01-03    1.205867
2013-01-04    0.198191
2013-01-05    1.429235
2013-01-06    1.722446
Freq: D, Name: A, dtype: float64

In [44]:
df['A']

2013-01-01   -0.435571
2013-01-02    1.557891
2013-01-03    1.205867
2013-01-04    0.198191
2013-01-05    1.429235
2013-01-06    1.722446
Freq: D, Name: A, dtype: float64

In [45]:
# 여러 행렬을 가져올 땐 리스트로 묶어서
df[['A','B']]

                   A         B
2013-01-01 -0.435571  0.116686
2013-01-02  1.557891  0.043704
2013-01-03  1.205867  0.136809
2013-01-04  0.198191  1.046273
2013-01-05  1.429235 -1.690102
2013-01-06  1.722446 -0.275181

In [50]:
# 행은 loc함수로 꺼낼 수 있음
df.loc['20130102']

A    1.557891
B    0.043704
C    1.250088
D   -0.169691
Name: 2013-01-02 00:00:00, dtype: float64

In [51]:
# 또는 인덱스 범위를 넣어주면 행단위로 꺼내오기 가능
df[0:3]

                   A         B         C         D
2013-01-01 -0.435571  0.116686  0.414054 -0.696546
2013-01-02  1.557891  0.043704  1.250088 -0.169691
2013-01-03  1.205867  0.136809  1.125442 -1.530207

In [52]:
df.loc[dates[0]]

A   -0.435571
B    0.116686
C    0.414054
D   -0.696546
Name: 2013-01-01 00:00:00, dtype: float64

In [57]:
df.loc['20130102':'20130105',['A','B']]

                   A         B
2013-01-02  1.557891  0.043704
2013-01-03  1.205867  0.136809
2013-01-04  0.198191  1.046273
2013-01-05  1.429235 -1.690102

In [54]:
# 앞은 행의 범위, 뒤는 열의 범위
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.435571  0.116686
2013-01-02  1.557891  0.043704
2013-01-03  1.205867  0.136809
2013-01-04  0.198191  1.046273
2013-01-05  1.429235 -1.690102
2013-01-06  1.722446 -0.275181

In [58]:
# iloc: 인덱스로 가져오기
df.iloc[3]

A    0.198191
B    1.046273
C   -0.067392
D    0.808591
Name: 2013-01-04 00:00:00, dtype: float64

In [59]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.116686  0.414054
2013-01-02  0.043704  1.250088
2013-01-03  0.136809  1.125442
2013-01-04  1.046273 -0.067392
2013-01-05 -1.690102  0.887965
2013-01-06 -0.275181  0.085287

In [60]:
df.iloc[1,1]

0.04370352403531505

In [68]:
# B열 값 중 양수인 열만 뽑아서 출력한다.
df[df['B']>0]

                   A         B         C         D
2013-01-01 -0.435571  0.116686  0.414054 -0.696546
2013-01-02  1.557891  0.043704  1.250088 -0.169691
2013-01-03  1.205867  0.136809  1.125442 -1.530207
2013-01-04  0.198191  1.046273 -0.067392  0.808591

In [69]:
# 조건에 만족하는 값만 원래 값을 리턴, 만족하지 않으면 nan을 리턴
df[df>0]

                   A         B         C         D
2013-01-01       NaN  0.116686  0.414054       NaN
2013-01-02  1.557891  0.043704  1.250088       NaN
2013-01-03  1.205867  0.136809  1.125442       NaN
2013-01-04  0.198191  1.046273       NaN  0.808591
2013-01-05  1.429235       NaN  0.887965       NaN
2013-01-06  1.722446       NaN  0.085287       NaN

In [71]:
df2 = df.copy()
df2

                   A         B         C         D
2013-01-01 -0.435571  0.116686  0.414054 -0.696546
2013-01-02  1.557891  0.043704  1.250088 -0.169691
2013-01-03  1.205867  0.136809  1.125442 -1.530207
2013-01-04  0.198191  1.046273 -0.067392  0.808591
2013-01-05  1.429235 -1.690102  0.887965 -0.199856
2013-01-06  1.722446 -0.275181  0.085287 -0.440648

In [78]:
# 주소값이 같으므로 df3를 편집하면 df도 같이 편집됨
df3=df
id(df) == id(df3)

True

In [73]:
id(df3)

140446731942928

In [74]:
id(df)

140446731942928

In [75]:
id(df2)

140446726989328

In [79]:
id(df) == id(df2)

False

In [82]:
# 자료 추가할 때 갯수 맞춰줘야 함
df2['E'] = ['one','one','two','three','four','five']

In [84]:
# 해당 열에 값이 있는지 검사, T/F로 리턴
df2.E.isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [85]:
# 조건에 맞는 행을 테이블에서 가져온다.
df2[df2.E.isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  1.205867  0.136809  1.125442 -1.530207   two
2013-01-05  1.429235 -1.690102  0.887965 -0.199856  four

In [91]:
s1=pd.Series([1,2,3,4,5,6],index=pd.date_range('20130102',periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [92]:
# 인덱스(행)을 맞춰서 삽입됨
df2['F']=s1
df2

                   A         B         C         D      E    F
2013-01-01 -0.435571  0.116686  0.414054 -0.696546    one  NaN
2013-01-02  1.557891  0.043704  1.250088 -0.169691    one  1.0
2013-01-03  1.205867  0.136809  1.125442 -1.530207    two  2.0
2013-01-04  0.198191  1.046273 -0.067392  0.808591  three  3.0
2013-01-05  1.429235 -1.690102  0.887965 -0.199856   four  4.0
2013-01-06  1.722446 -0.275181  0.085287 -0.440648   five  5.0

In [94]:
#위치값으로 값 갱신 가능
df.at[dates[0],'A'] = 0
df

                   A         B         C         D   F
2013-01-01  0.000000  0.116686  0.414054 -0.696546 NaN
2013-01-02  1.557891  0.043704  1.250088 -0.169691 NaN
2013-01-03  1.205867  0.136809  1.125442 -1.530207 NaN
2013-01-04  0.198191  1.046273 -0.067392  0.808591 NaN
2013-01-05  1.429235 -1.690102  0.887965 -0.199856 NaN
2013-01-06  1.722446 -0.275181  0.085287 -0.440648 NaN

In [95]:
df.iat[0,1]

0.11668642929956402

In [97]:
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D   F
2013-01-01  0.000000  0.116686  0.414054  5 NaN
2013-01-02  1.557891  0.043704  1.250088  5 NaN
2013-01-03  1.205867  0.136809  1.125442  5 NaN
2013-01-04  0.198191  1.046273 -0.067392  5 NaN
2013-01-05  1.429235 -1.690102  0.887965  5 NaN
2013-01-06  1.722446 -0.275181  0.085287  5 NaN

In [99]:
df.loc[:,'D'] = df2.loc[:,"D"]
df

                   A         B         C         D   F
2013-01-01  0.000000  0.116686  0.414054 -0.696546 NaN
2013-01-02  1.557891  0.043704  1.250088 -0.169691 NaN
2013-01-03  1.205867  0.136809  1.125442 -1.530207 NaN
2013-01-04  0.198191  1.046273 -0.067392  0.808591 NaN
2013-01-05  1.429235 -1.690102  0.887965 -0.199856 NaN
2013-01-06  1.722446 -0.275181  0.085287 -0.440648 NaN

In [101]:
df4 = df.copy()
df4

                   A         B         C         D   F
2013-01-01  0.000000  0.116686  0.414054 -0.696546 NaN
2013-01-02  1.557891  0.043704  1.250088 -0.169691 NaN
2013-01-03  1.205867  0.136809  1.125442 -1.530207 NaN
2013-01-04  0.198191  1.046273 -0.067392  0.808591 NaN
2013-01-05  1.429235 -1.690102  0.887965 -0.199856 NaN
2013-01-06  1.722446 -0.275181  0.085287 -0.440648 NaN

In [103]:
df4.loc[:,'D'] = np.array([5] * len(df))

In [104]:
df4[df4>0]

                   A         B         C  D   F
2013-01-01       NaN  0.116686  0.414054  5 NaN
2013-01-02  1.557891  0.043704  1.250088  5 NaN
2013-01-03  1.205867  0.136809  1.125442  5 NaN
2013-01-04  0.198191  1.046273       NaN  5 NaN
2013-01-05  1.429235       NaN  0.887965  5 NaN
2013-01-06  1.722446       NaN  0.085287  5 NaN

In [105]:
# 조건에 만족하는 값만 마이너스 부호가 붙는다.
df4[df4>0] = -df4
df4

                   A         B         C  D   F
2013-01-01  0.000000 -0.116686 -0.414054 -5 NaN
2013-01-02 -1.557891 -0.043704 -1.250088 -5 NaN
2013-01-03 -1.205867 -0.136809 -1.125442 -5 NaN
2013-01-04 -0.198191 -1.046273 -0.067392 -5 NaN
2013-01-05 -1.429235 -1.690102 -0.887965 -5 NaN
2013-01-06 -1.722446 -0.275181 -0.085287 -5 NaN

In [107]:
# reindex: 인덱스 새로 고침
# 원래 컬럼에 + E 컬럼을 추가
df1 = df.reindex(index=dates[0:4], columns=list(df.columns)+['E'])
df1

                   A         B         C         D   F   E
2013-01-01  0.000000  0.116686  0.414054 -0.696546 NaN NaN
2013-01-02  1.557891  0.043704  1.250088 -0.169691 NaN NaN
2013-01-03  1.205867  0.136809  1.125442 -1.530207 NaN NaN
2013-01-04  0.198191  1.046273 -0.067392  0.808591 NaN NaN

In [ ]:
# loc: 라벨로 접근
df1.loc[dates[0]:dates[1],'E'] = 1
df1.loc[:,'F'] = 5
df1

In [112]:
# nan인 데이터 삭제
# axis: 제거되는 축 default=0(인텍스),1(컬럼)
# implace: 원본 반영여부, default=False
df1.dropna(how='any')

                   A         B         C         D  F    E
2013-01-01  0.000000  0.116686  0.414054 -0.696546  5  1.0
2013-01-02  1.557891  0.043704  1.250088 -0.169691  5  1.0

In [120]:
# 비어있는 값을 채우는 함수
df1.fillna(value=3)

                   A         B         C         D  F    E
2013-01-01  0.000000  0.116686  0.414054 -0.696546  5  1.0
2013-01-02  1.557891  0.043704  1.250088 -0.169691  5  1.0
2013-01-03  1.205867  0.136809  1.125442 -1.530207  5  3.0
2013-01-04  0.198191  1.046273 -0.067392  0.808591  5  3.0

In [122]:
s = pd.Series([1,3,5,7,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    7.0
Freq: D, dtype: float64

In [123]:
# df에서 s를 뺀다.
# 이때, NaN값이 있으면 게산이 안됨
df.sub(s,axis='index')

                   A         B         C         D   F
2013-01-01       NaN       NaN       NaN       NaN NaN
2013-01-02       NaN       NaN       NaN       NaN NaN
2013-01-03  0.205867 -0.863191  0.125442 -2.530207 NaN
2013-01-04 -2.801809 -1.953727 -3.067392 -2.191409 NaN
2013-01-05 -3.570765 -6.690102 -4.112035 -5.199856 NaN
2013-01-06 -5.277554 -7.275181 -6.914713 -7.440648 NaN

In [125]:
df

                   A         B         C         D   F
2013-01-01  0.000000  0.116686  0.414054 -0.696546 NaN
2013-01-02  1.557891  0.043704  1.250088 -0.169691 NaN
2013-01-03  1.205867  0.136809  1.125442 -1.530207 NaN
2013-01-04  0.198191  1.046273 -0.067392  0.808591 NaN
2013-01-05  1.429235 -1.690102  0.887965 -0.199856 NaN
2013-01-06  1.722446 -0.275181  0.085287 -0.440648 NaN

In [126]:
# numpy.cumsum: Return the cumulative sum of the elements along a given axis.
df.apply(np.cumsum)

                   A         B         C         D   F
2013-01-01  0.000000  0.116686  0.414054 -0.696546 NaN
2013-01-02  1.557891  0.160390  1.664142 -0.866237 NaN
2013-01-03  2.763758  0.297199  2.789584 -2.396444 NaN
2013-01-04  2.961949  1.343472  2.722191 -1.587854 NaN
2013-01-05  4.391184 -0.346630  3.610157 -1.787710 NaN
2013-01-06  6.113629 -0.621811  3.695443 -2.228358 NaN

In [127]:
# apply: Applying functions to the data
df.apply(lambda x: x.max()-x.min())

A    1.722446
B    2.736374
C    1.317480
D    2.338798
F         NaN
dtype: float64

In [128]:
# 데이터 프레임 자체는 적용 불가
df.value_counts()

AttributeError: 'DataFrame' object has no attribute 'value_counts'

In [129]:
# 컬럼으로 적용가능
df['A'].value_counts()

1.205867    1
0.198191    1
1.722446    1
1.557891    1
1.429235    1
0.000000    1
Name: A, dtype: int64

In [130]:
s = pd.Series(np.random.randint(0,7,size=10))

In [131]:
s

0    5
1    5
2    1
3    4
4    0
5    2
6    6
7    0
8    1
9    6
dtype: int64

In [134]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s

0       A
1       B
2       C
3    Aaba
4    Baca
5     NaN
6    CABA
7     dog
8     cat
dtype: object

In [135]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [137]:
df = pd.DataFrame(np.random.randn(10,4))
df

          0         1         2         3
0  1.077092  0.293257  0.302822 -1.459592
1  0.075214  0.259007 -0.328493  1.156814
2 -0.897666  0.730278  0.602183  0.094684
3 -1.098949 -0.566495 -0.429195 -0.294152
4  0.682128 -0.239298  0.989344 -0.277133
5  0.666399 -1.631637 -0.039409 -0.841965
6  0.922834 -0.222063  2.091092  1.050856
7 -1.531494 -0.128673 -0.133739  1.993693
8 -0.078863  1.306801  0.437515 -0.361790
9 -0.005868 -1.104656 -1.405033  0.590185

In [140]:
pieces = [df[:3],df[3:7],df[7:]]
pieces

[          0         1         2         3
 0  1.077092  0.293257  0.302822 -1.459592
 1  0.075214  0.259007 -0.328493  1.156814
 2 -0.897666  0.730278  0.602183  0.094684,
           0         1         2         3
 3 -1.098949 -0.566495 -0.429195 -0.294152
 4  0.682128 -0.239298  0.989344 -0.277133
 5  0.666399 -1.631637 -0.039409 -0.841965
 6  0.922834 -0.222063  2.091092  1.050856,
           0         1         2         3
 7 -1.531494 -0.128673 -0.133739  1.993693
 8 -0.078863  1.306801  0.437515 -0.361790
 9 -0.005868 -1.104656 -1.405033  0.590185]

In [151]:
pd.concat(pieces)

          0         1         2         3
0  1.077092  0.293257  0.302822 -1.459592
1  0.075214  0.259007 -0.328493  1.156814
2 -0.897666  0.730278  0.602183  0.094684
3 -1.098949 -0.566495 -0.429195 -0.294152
4  0.682128 -0.239298  0.989344 -0.277133
5  0.666399 -1.631637 -0.039409 -0.841965
6  0.922834 -0.222063  2.091092  1.050856
7 -1.531494 -0.128673 -0.133739  1.993693
8 -0.078863  1.306801  0.437515 -0.361790
9 -0.005868 -1.104656 -1.405033  0.590185

In [152]:
pd.concat([df,pieces[0]])

          0         1         2         3
0  1.077092  0.293257  0.302822 -1.459592
1  0.075214  0.259007 -0.328493  1.156814
2 -0.897666  0.730278  0.602183  0.094684
3 -1.098949 -0.566495 -0.429195 -0.294152
4  0.682128 -0.239298  0.989344 -0.277133
5  0.666399 -1.631637 -0.039409 -0.841965
6  0.922834 -0.222063  2.091092  1.050856
7 -1.531494 -0.128673 -0.133739  1.993693
8 -0.078863  1.306801  0.437515 -0.361790
9 -0.005868 -1.104656 -1.405033  0.590185
0  1.077092  0.293257  0.302822 -1.459592
1  0.075214  0.259007 -0.328493  1.156814
2 -0.897666  0.730278  0.602183  0.094684

In [154]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
left

   key  lval
0  foo     1
1  foo     2

In [155]:
right

   key  rval
0  foo     4
1  foo     5

In [156]:
# on 뒤에다 어떤 걸로 merge시킬 것인지를 적음
pd.merge(left,right,on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [157]:
# df를 csv 파일로 저장
df.to_csv('foo.csv')

In [164]:
df1=pd.read_csv('user.csv')
df1

  userid  username   userage         usertel
0   hong       홍길동        23   010-1111-2222
1   choi       최정윤        24   010-5786-9870
2   hyun       김영현        25   010-5555-1110

In [165]:
# 엑셀파일로 저장할때는 sheet이름도 지정해야 함
df.to_excel('foo.xlsx',sheet_name='Sheet1')

In [166]:
pip show pymysql

Name: PyMySQL
Version: 0.9.3
Summary: Pure Python MySQL Driver
Home-page: https://github.com/PyMySQL/PyMySQL/
Author: yutaka.matsubara
Author-email: yutaka.matsubara@gmail.com
License: "MIT"
Location: /opt/conda/lib/python3.7/site-packages
Requires:
Required-by:
Note: you may need to restart the kernel to use updated packages.

In [167]:
pip show pandas

Name: pandas
Version: 0.25.1
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: http://pandas.pydata.org
Author: None
Author-email: None
License: BSD
Location: /opt/conda/lib/python3.7/site-packages
Requires: numpy, pytz, python-dateutil
Required-by: vincent, statsmodels, seaborn, plotnine, mizani
Note: you may need to restart the kernel to use updated packages.

In [168]:
pip show sqlalchemy

Name: SQLAlchemy
Version: 1.3.9
Summary: Database Abstraction Library
Home-page: http://www.sqlalchemy.org
Author: Mike Bayer
Author-email: mike_mp@zzzcomputing.com
License: MIT
Location: /opt/conda/lib/python3.7/site-packages
Requires:
Required-by: Flask-SQLAlchemy
Note: you may need to restart the kernel to use updated packages.